assignment_3/todolists/app/controllers/todo_items_controller.rb

SELECT "todo_items".* FROM "todo_items"
---
  def index
    @todo_items = TodoItem.all

INSERT INTO "todo_items" ("title", "description", "due_date", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Hola mundo"], ["description", "Hola mundo"], ["due_date", "2020-06-03"], ["completed", "f"], ["created_at", "2020-07-01 22:56:45.977570"], ["updated_at", "2020-07-01 22:56:45.977570"]]
---
  def create
    @todo_item = TodoItem.new(todo_item_params)
    respond_to do |format|
      if @todo_item.save

UPDATE "todo_items" SET "title" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["title", "Task edited"], ["updated_at", "2020-07-01 23:22:57.571502"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @todo_item.update(todo_item_params)

DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 4]]
---
  def destroy
    @todo_item.destroy

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_todo_item
      @todo_item = TodoItem.find(params[:id])